name: "VGG_CNN_M_1024"
input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 224
  dim: 224
}
input: "rois"
input_shape {
  dim: 1 # to be changed on-the-fly to num ROIs
  dim: 5 # [batch ind, x1, y1, x2, y2] zero-based indexing
}
input: "boxscores"
input_shape {
  dim: 1 # to be changed on-the-fly to num ROIs
}

##################################




##################################
layer {
  name: "eltwise-prod"
  type: "Eltwise"
  bottom: "classification_prob"
  bottom: "detection_prob"
  top: "cls_prob"
  eltwise_param { operation: PROD }
}

